Revit 2026 API

# StairsRunGetNumberSystemReference Method

---

Gets the number system reference corresponding to the given reference options.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Reference GetNumberSystemReference(
	StairsNumberSystemReferenceOption referenceOption
)
```
```vb
Public Function GetNumberSystemReference (
	referenceOption As StairsNumberSystemReferenceOption
) As Reference
```
```cpp
public:
Reference^ GetNumberSystemReference(
	StairsNumberSystemReferenceOption referenceOption
)
```
```fsharp
member GetNumberSystemReference :
        referenceOption : StairsNumberSystemReferenceOption -> Reference
```

#### Parameters

referenceOption StairsNumberSystemReferenceOption
     The reference option.

#### Return Value

Reference The reference.

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

The return value of this function is suitable for use in NumberSystem.Create() to associate a NumberSystem with the location on the StairsRun. Don't try to get geometry curve from the reference.

#### Reference

StairsRun Class

Autodesk.Revit.DB.Architecture Namespace